pytrustnfe/nfse/dsf/soap_header.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soapenv:Body>
        <ns1:enviarLoteNotas soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"
            xmlns:ns1="http://ws.pc.gif.com.br/">
            <xml xsi:type="xsd:string">
                <![CDATA[
				{% block content %}{% endblock %}
			]]>
            </xml>
        </ns1:enviarLoteNotas>
    </soapenv:Body>
</soapenv:Envelope>